lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
/* Subevent result done-status values matching the host-side constants
 * kBleCsProcedureDoneAborted / kBleCsSubeventDoneAborted (0x0F). */
#define BLE_CS_PROCEDURE_DONE_ABORTED 0x0FU
#define BLE_CS_SUBEVENT_DONE_ABORTED 0x0FU

enum {
  BLE_CS_HCI_STATUS_SUCCESS = 0x00U,
  BLE_CS_HCI_STATUS_COMMAND_DISALLOWED = 0x0CU,
  BLE_CS_HCI_STATUS_INVALID_PARAMS = 0x12U,
};

#if VPR_CS_DEDICATED_IMAGE
static void clear_active_cs_state(void);
static uint32_t pack_demo_channels_from_map(const uint8_t *channel_map);
static vpr_cs_config_slot_t *find_cs_slot(uint8_t config_id);
static vpr_cs_config_slot_t *allocate_cs_slot(uint8_t config_id);
static vpr_cs_config_slot_t *promote_previous_slot_to_primary(bool preserve_displaced);
static void clear_cs_slot(vpr_cs_config_slot_t *slot);
static bool any_cs_slot_in_use(void);
static bool has_free_cs_slot(void);
static bool load_active_state_from_slot(const vpr_cs_config_slot_t *slot);
static void store_active_create_state(vpr_cs_config_slot_t *slot);
static void store_active_procedure_state(vpr_cs_config_slot_t *slot);
static void preserve_active_state_to_slot(void);
static void clear_active_runtime_state(void);
static void clear_active_config_selection(void);
static void clear_all_cs_state(void);
#endif

static inline void fence_rw(void) {
  __asm__ volatile("fence rw, rw" ::: "memory");
}

static inline void enable_machine_interrupts(void) {
  const uint32_t mie_mask = 0x8U;
  __asm__ volatile("csrs mstatus, %0" : : "r"(mie_mask) : "memory");
}

static inline void write_vpr_sleepctrl(uint32_t value) {
  __asm__ volatile("csrw %0, %1" : : "i"(VPRCSR_NORDIC_VPRNORDICSLEEPCTRL), "r"(value));
}

static inline void write_vpr_nordic_ctrl(uint32_t value) {
  __asm__ volatile("csrw %0, %1" : : "i"(VPRCSR_NORDIC_VPRNORDICCTRL), "r"(value));
}

static void bytes_zero(void *dst, size_t len) {
  uint8_t *out = (uint8_t *)dst;
  if (out == NULL) {
    return;
  }
  for (size_t i = 0U; i < len; ++i) {
    out[i] = 0U;
  }
}

static void bytes_copy(void *dst, const void *src, size_t len) {
  uint8_t *out = (uint8_t *)dst;
  const uint8_t *in = (const uint8_t *)src;
  if (out == NULL || in == NULL) {
    return;
  }
  for (size_t i = 0U; i < len; ++i) {
    out[i] = in[i];
  }
}

void *memset(void *dst, int value, size_t len) {
  uint8_t *out = (uint8_t *)dst;
  if (out == NULL) {
    return dst;
  }
  for (size_t i = 0U; i < len; ++i) {
    out[i] = (uint8_t)value;
  }
  return dst;
}

#if VPR_CS_DEDICATED_IMAGE
static void reset_dedicated_cs_state(void) {
  g_cs_config_id = 1U;
  g_cs_procedure_counter = 0U;
  g_cs_session_conn_handle = 0U;
  g_cs_demo_channels_packed = 0x241A0E02U;
  g_cs_main_mode_type = BLE_CS_MAIN_MODE2;
  g_cs_sub_mode_type = 0xFFU;
  g_cs_min_main_mode_steps = 3U;
  g_cs_max_main_mode_steps = 5U;
  g_cs_main_mode_repetition = 1U;
  g_cs_mode0_steps = 1U;
  g_cs_role = 0U;
  g_cs_rtt_type = 1U;
  g_cs_cs_sync_phy = 2U;
  g_cs_channel_map[0] = 0xFFU;
  g_cs_channel_map[1] = 0xFFU;
  g_cs_channel_map[2] = 0xFFU;
  g_cs_channel_map[3] = 0xFFU;
  g_cs_channel_map[4] = 0x1FU;
  g_cs_channel_map[5] = 0x00U;
  g_cs_channel_map[6] = 0x00U;
  g_cs_channel_map[7] = 0x00U;
  g_cs_channel_map[8] = 0x00U;
  g_cs_channel_map[9] = 0x00U;
  g_cs_channel_map_repetition = 1U;
  g_cs_channel_selection_type = 1U;
  g_cs_ch3c_shape = 1U;
  g_cs_ch3c_jump = 3U;
  g_cs_enhancements1 = 0x01U;
  g_cs_max_tx_power_dbm = -8;
  g_cs_max_procedure_len = 12U;
  g_cs_min_procedure_interval = 200U;
  g_cs_max_procedure_interval = 300U;
  g_cs_max_procedure_count = 8U;
  g_cs_min_subevent_len = 0x000456UL;
  g_cs_max_subevent_len = 0x000678UL;
  g_cs_tone_antenna_config_selection = 2U;
  g_cs_phy = 2U;
  g_cs_tx_power_delta = -6;
  g_cs_config_created = 0U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_procedure_enabled = 0U;
  g_cs_session_open = 0U;
  g_cs_last_evicted_config_id = 0U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  g_cs_last_interval_selector = 0U;
  g_cs_active_subevent_index = 0U;
  g_cs_local_chunk_start_step = 0U;
  g_cs_peer_chunk_start_step = 0U;
  g_cs_procedure_abort_reason = 0U;
  g_cs_subevent_abort_reason = 0U;
  g_cs_peer_exchange_deadline = 0U;
  g_cs_peer_exchange_stage = 0U;
  g_cs_builtin_peer_demo_enabled = 0U;
}
#endif

static void zero_vpr_data(void) {
  for (uint32_t i = 0U; i < NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA; ++i) {
    g_vpr_transport->vprData[i] = 0U;
  }
}

#if !VPR_CS_DEDICATED_IMAGE
static void clear_ticker_event_queue(void) {
  bytes_zero(g_ticker_event_queue, sizeof(g_ticker_event_queue));
  g_ticker_event_queue_head = 0U;
  g_ticker_event_queue_tail = 0U;
  g_ticker_event_queue_count = 0U;
}

static bool enqueue_ticker_event(uint32_t count, uint32_t step, uint32_t heartbeat) {
  if (g_ticker_event_queue_count >= VPR_TICKER_EVENT_QUEUE_DEPTH) {
    g_ticker_event_drop_count = g_ticker_event_drop_count + 1U;
    return false;
  }
  vpr_ticker_event_entry_t *entry = &g_ticker_event_queue[g_ticker_event_queue_tail];
  entry->flags = 0U;
  entry->count = count;
  entry->step = step;
  entry->heartbeat = heartbeat;
  g_ticker_event_sequence = g_ticker_event_sequence + 1U;
  entry->sequence = g_ticker_event_sequence;
  g_ticker_event_queue_tail = (g_ticker_event_queue_tail + 1U) % VPR_TICKER_EVENT_QUEUE_DEPTH;
  g_ticker_event_queue_count = g_ticker_event_queue_count + 1U;
  g_ticker_event_last_emitted_count = count;
  return true;
}

static void clear_ble_legacy_adv_event_queue(void) {
  bytes_zero(g_ble_legacy_adv_event_queue, sizeof(g_ble_legacy_adv_event_queue));
  g_ble_legacy_adv_event_queue_head = 0U;
  g_ble_legacy_adv_event_queue_tail = 0U;
  g_ble_legacy_adv_event_queue_count = 0U;
}

static uint8_t normalize_ble_legacy_adv_channel_mask(uint8_t mask) {
  mask = (uint8_t)(mask & 0x07U);
  if (mask == 0U) {
    mask = 0x01U;
  }
  return mask;
}

static uint8_t pick_next_ble_legacy_adv_channel(uint8_t mask) {
  mask = normalize_ble_legacy_adv_channel_mask(mask);
  for (uint8_t offset = 0U; offset < 3U; ++offset) {
    const uint8_t candidate_index =
        (uint8_t)((g_ble_legacy_adv_next_channel_index + offset) % 3U);
    const uint8_t candidate_mask = (uint8_t)(1U << candidate_index);
    if ((mask & candidate_mask) != 0U) {
      g_ble_legacy_adv_next_channel_index = (uint8_t)((candidate_index + 1U) % 3U);
      return candidate_mask;
    }
  }
  g_ble_legacy_adv_next_channel_index = 1U;
  return 0x01U;
}

static uint32_t ble_legacy_adv_random_delay_ticks(uint32_t heartbeat,
                                                  uint32_t event_count,
                                                  uint32_t interval_ticks) {
  if (g_ble_legacy_adv_add_random_delay == 0U || interval_ticks == 0U) {
    return 0U;
  }
  uint32_t max_extra = interval_ticks / 8U;
  if (max_extra < 64U) {
    max_extra = 64U;
  }
  if (max_extra > 16000U) {
    max_extra = 16000U;
  }
  const uint32_t seed = (heartbeat * 1103515245UL) ^ (event_count * 2654435761UL);
  return seed % (max_extra + 1U);
}

