lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static void encode_pct_sample_bytes(int16_t i, int16_t q, uint8_t out_pct[3]) {
  uint16_t i12 = 0U;
  uint16_t q12 = 0U;
  uint32_t packed = 0U;
  if (out_pct == NULL) {
    return;
  }
  i12 = (uint16_t)clamp_pct12_component(i) & 0x0FFFU;
  q12 = (uint16_t)clamp_pct12_component(q) & 0x0FFFU;
  packed = (uint32_t)i12 | ((uint32_t)q12 << 12U);
  out_pct[0] = (uint8_t)(packed & 0xFFU);
  out_pct[1] = (uint8_t)((packed >> 8U) & 0xFFU);
  out_pct[2] = (uint8_t)((packed >> 16U) & 0xFFU);
}

static void scale_pct_sample_bytes(const uint8_t input_pct[3], uint16_t scale_q10,
                                   uint8_t out_pct[3]) {
  int16_t i = 0;
  int16_t q = 0;
  int32_t scaled_i = 0;
  int32_t scaled_q = 0;
  if (input_pct == NULL || out_pct == NULL) {
    return;
  }
  decode_pct_sample_bytes(input_pct, &i, &q);
  scaled_i = ((int32_t)i * (int32_t)scale_q10 + 512) / 1024;
  scaled_q = ((int32_t)q * (int32_t)scale_q10 + 512) / 1024;
  encode_pct_sample_bytes(clamp_pct12_component(scaled_i),
                          clamp_pct12_component(scaled_q), out_pct);
}

static void rotate_pct_sample_bytes_quarter_turns(const uint8_t input_pct[3], uint8_t quarter_turns,
                                                  uint8_t out_pct[3]) {
  int16_t i = 0;
  int16_t q = 0;
  int16_t rotated_i = 0;
  int16_t rotated_q = 0;
  if (input_pct == NULL || out_pct == NULL) {
    return;
  }
  decode_pct_sample_bytes(input_pct, &i, &q);
  switch (quarter_turns & 0x03U) {
    case 0U:
      rotated_i = i;
      rotated_q = q;
      break;
    case 1U:
      rotated_i = clamp_pct12_component(-(int32_t)q);
      rotated_q = i;
      break;
    case 2U:
      rotated_i = clamp_pct12_component(-(int32_t)i);
      rotated_q = clamp_pct12_component(-(int32_t)q);
      break;
    default:
      rotated_i = q;
      rotated_q = clamp_pct12_component(-(int32_t)i);
      break;
  }
  encode_pct_sample_bytes(rotated_i, rotated_q, out_pct);
}

static uint16_t current_local_demo_scale_q10(uint8_t step_index) {
  uint16_t scale = ((step_index & 0x01U) != 0U) ? 736U : 896U;
  scale = (uint16_t)(scale + ((current_step_count_group() & 0x03U) * 32U));
  if (scale > 1024U) {
    scale = 1024U;
  }
  return scale;
}

static uint8_t current_local_demo_phase_quadrant(uint8_t step_index) {
  return (uint8_t)((current_step_count_group() + current_channel_selection_group() +
                    step_index) &
                   0x03U);
}

static uint16_t current_peer_demo_scale_q10(uint8_t channel, uint8_t step_index) {
  uint16_t attenuation = 0U;
  uint16_t channel_offset = 0U;
  int32_t scale = (int32_t)current_local_demo_scale_q10(step_index);

  if (g_cs_tx_power_delta < 0) {
    attenuation = (uint16_t)((uint8_t)(-g_cs_tx_power_delta) * 12U);
  }
  channel_offset =
      (uint16_t)(((channel + (uint8_t)current_channel_selection_group()) % 3U) * 24U);
  scale -= (int32_t)attenuation;
  scale += (int32_t)channel_offset - 24;
  if (scale < 512) {
    scale = 512;
  }
  if (scale > 1024) {
    scale = 1024;
  }
  return (uint16_t)scale;
}
#endif

static uint8_t current_demo_antenna_permutation(uint8_t step_index) {
  uint8_t count = g_cs_tone_antenna_config_selection;
  if (count == 0U) {
    count = 1U;
  }
  if (count > 4U) {
    count = 4U;
  }
  return (uint8_t)((current_step_count_group() + step_index) % count);
}

static void append_mode2_sample_step(uint8_t *dst, uint8_t channel, uint8_t permutation_index,
                                     uint8_t quality, const uint8_t pct[3]) {
  if (dst == NULL || pct == NULL) {
    return;
  }
  dst[0] = BLE_CS_MAIN_MODE2;
  dst[1] = channel;
  dst[2] = 5U;
  dst[3] = permutation_index;
  dst[4] = pct[0];
  dst[5] = pct[1];
  dst[6] = pct[2];
  dst[7] = (uint8_t)(quality & 0x0FU);
}

static size_t append_mode1_unavailable_step(uint8_t *dst, uint8_t channel,
                                            uint8_t packet_antenna) {
  if (dst == NULL) {
    return 0U;
  }
  dst[0] = BLE_CS_MAIN_MODE1;
  dst[1] = channel;
  dst[2] = 6U;
  dst[3] = 0xF2U;
  dst[4] = 0xFFU;
  dst[5] = 0x7FU;
  write_le16(&dst[6], 0x8000U);
  dst[8] = packet_antenna;
  return 9U;
}

static void append_mode2_demo_step(uint8_t *dst, uint8_t channel, uint8_t step_index) {
#if VPR_CS_DEDICATED_IMAGE
  uint8_t scaled_pct[3];
  uint8_t shaped_pct[3];
  scale_pct_sample_bytes(k_local_demo_pct_sample, current_local_demo_scale_q10(step_index),
                         scaled_pct);
  rotate_pct_sample_bytes_quarter_turns(scaled_pct, current_local_demo_phase_quadrant(step_index),
                                        shaped_pct);
  append_mode2_sample_step(dst, channel, current_demo_antenna_permutation(step_index),
                           ((step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                        : VPR_CS_TONE_QUALITY_HIGH,
                           shaped_pct);
#else
  append_mode2_sample_step(dst, channel, current_demo_antenna_permutation(step_index),
                           ((step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                        : VPR_CS_TONE_QUALITY_HIGH,
                           k_local_demo_pct_sample);
#endif
}

#if VPR_CS_DEDICATED_IMAGE
static void append_mode2_peer_demo_step(uint8_t *dst, uint8_t channel, uint8_t step_index) {
  uint8_t scaled_pct[3];
  uint8_t shaped_pct[3];
  const uint8_t *pct =
      (channel < 39U) ? k_peer_demo_pct_samples[channel] : k_local_demo_pct_sample;
  const uint8_t phase_quadrant = current_local_demo_phase_quadrant(step_index);
  scale_pct_sample_bytes(pct, current_peer_demo_scale_q10(channel, step_index), scaled_pct);
  rotate_pct_sample_bytes_quarter_turns(scaled_pct, (uint8_t)((4U - phase_quadrant) & 0x03U),
                                        shaped_pct);
  append_mode2_sample_step(dst, channel, current_demo_antenna_permutation(step_index),
                           ((step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                        : VPR_CS_TONE_QUALITY_HIGH,
                           shaped_pct);
}

static bool channel_map_bit_enabled(const uint8_t *channel_map, uint8_t bit) {
  if (channel_map == NULL || bit >= 80U) {
    return false;
  }
  return (channel_map[bit >> 3U] & (uint8_t)(1U << (bit & 0x07U))) != 0U;
}

static bool channel_map_has_enabled_channels(const uint8_t *channel_map) {
  if (channel_map == NULL) {
    return false;
  }
  for (uint8_t i = 0U; i < 10U; ++i) {
    if (channel_map[i] != 0U) {
      return true;
    }
  }
  return false;
}

static uint16_t current_channel_selection_group(void) {
  uint16_t procedure_index = (g_cs_procedure_counter > 0U) ? (uint16_t)(g_cs_procedure_counter - 1U)
                                                           : 0U;
  if (g_cs_channel_map_repetition > 1U) {
    procedure_index = (uint16_t)(procedure_index / g_cs_channel_map_repetition);
  }
  return procedure_index;
}

static uint16_t current_step_count_group(void) {
  uint16_t procedure_index = (g_cs_procedure_counter > 0U) ? (uint16_t)(g_cs_procedure_counter - 1U)
                                                           : 0U;
  if (g_cs_main_mode_repetition > 1U) {
    procedure_index = (uint16_t)(procedure_index / g_cs_main_mode_repetition);
  }
  return procedure_index;
}

