lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_vendor_ble_cs_peer_pdu_inject_complete_payload(uint8_t *payload,
                                                                   size_t max_len) {
  const uint8_t previous_stage = g_cs_peer_exchange_stage;
  size_t pdu_len = 0U;
  uint8_t status = validate_peer_pdu_inject_command(&pdu_len);
  if (status == BLE_CS_HCI_STATUS_SUCCESS) {
    handle_peer_cs_pdu((const uint8_t *)&g_host_transport->hostData[4], pdu_len);
  }
  return build_vendor_ble_cs_peer_exchange_payload(payload, max_len, status, previous_stage);
}

static size_t build_vendor_ble_cs_peer_stage_read_complete_payload(uint8_t *payload,
                                                                  size_t max_len) {
  const uint8_t previous_stage = g_cs_peer_exchange_stage;
  const uint8_t status = command_layout_is_exact(0U)
                             ? BLE_CS_HCI_STATUS_SUCCESS
                             : BLE_CS_HCI_STATUS_INVALID_PARAMS;
  return build_vendor_ble_cs_peer_exchange_payload(payload, max_len, status, previous_stage);
}

static size_t build_vendor_ble_cs_scheduler_read_complete_payload(uint8_t *payload,
                                                                  size_t max_len) {
  if (payload == NULL || max_len < 55U) {
    return 0U;
  }

  const uint8_t status = command_layout_is_exact(0U)
                             ? BLE_CS_HCI_STATUS_SUCCESS
                             : BLE_CS_HCI_STATUS_INVALID_PARAMS;
  uint8_t flags = 0U;
  uint8_t interval_selector = 0U;
  const uint8_t subevent_count = current_demo_subevent_count();
  const uint8_t total_steps = current_demo_total_step_count();
  const uint8_t subevent_start =
      current_demo_subevent_start_step(g_cs_active_subevent_index);
  const uint8_t subevent_steps =
      current_demo_subevent_step_count(g_cs_active_subevent_index);
  const uint16_t subevent_bytes =
      (uint16_t)current_demo_subevent_encoded_step_bytes(g_cs_active_subevent_index);
  const uint32_t procedure_interval_ticks =
      compute_procedure_interval_ticks(&interval_selector);

  if (g_cs_session_open != 0U) {
    flags |= 0x01U;
  }
  if (g_cs_procedure_enabled != 0U) {
    flags |= 0x02U;
  }
  if (g_pending_cs_result_stage != 0U) {
    flags |= 0x04U;
  }
  if (g_cs_peer_exchange_stage == VPR_CS_PEER_STAGE_PROCEDURE_ACTIVE) {
    flags |= 0x08U;
  }
  if (g_cs_builtin_peer_demo_enabled != 0U) {
    flags |= 0x10U;
  }
  if (g_cs_test_active != 0U) {
    flags |= 0x20U;
  }

  payload[0] = status;
  payload[1] = flags;
  payload[2] = g_pending_cs_result_stage;
  payload[3] = g_cs_active_subevent_index;
  payload[4] = subevent_count;
  payload[5] = total_steps;
  payload[6] = subevent_start;
  payload[7] = subevent_steps;
  payload[8] = g_cs_local_chunk_start_step;
  payload[9] = g_cs_peer_chunk_start_step;
  write_le16(&payload[10], g_cs_procedure_counter);
  write_le16(&payload[12], g_cs_session_conn_handle);
  write_le32(&payload[14], g_vpr_transport->heartbeat);
  write_le32(&payload[18], g_cs_next_procedure_heartbeat);
  write_le32(&payload[22], g_cs_next_subevent_heartbeat);
  write_le32(&payload[26], g_cs_next_peer_stage_heartbeat);
  write_le32(&payload[30], g_cs_next_chunk_stage_heartbeat);
  write_le32(&payload[34], procedure_interval_ticks);
  write_le32(&payload[38], current_subevent_stage_delay_ticks());
  write_le32(&payload[42], current_peer_stage_delay_ticks());
  write_le32(&payload[46], current_chunk_stage_delay_ticks());
  write_le16(&payload[50], subevent_bytes);
  payload[52] = g_cs_config_id;
  payload[53] = interval_selector;
  payload[54] = g_cs_last_peer_gap_ticks;
  return 55U;
}

static size_t build_vendor_ble_cs_measurement_work_read_complete_payload(uint8_t *payload,
                                                                         size_t max_len) {
  if (payload == NULL || max_len < 62U) {
    return 0U;
  }

  const uint8_t status = command_layout_is_exact(0U)
                             ? BLE_CS_HCI_STATUS_SUCCESS
                             : BLE_CS_HCI_STATUS_INVALID_PARAMS;
  uint8_t flags = 0U;
  uint8_t interval_selector = 0U;
  const uint8_t active_subevent = g_cs_active_subevent_index;
  const uint8_t subevent_count = current_demo_subevent_count();
  const uint8_t total_steps = current_demo_total_step_count();
  const uint8_t phase_step_count = current_demo_step_count();
  uint8_t step_channels[6] = {0};
  const uint8_t subevent_start = current_demo_subevent_start_step(active_subevent);
  const uint8_t subevent_steps = current_demo_subevent_step_count(active_subevent);
  const uint16_t subevent_bytes =
      (uint16_t)current_demo_subevent_encoded_step_bytes(active_subevent);
  const uint32_t procedure_interval_ticks =
      compute_procedure_interval_ticks(&interval_selector);
  const uint8_t ready = (g_cs_session_open != 0U &&
                         g_cs_procedure_counter != 0U &&
                         total_steps != 0U &&
                         subevent_count != 0U &&
                         subevent_steps != 0U)
                            ? 1U
                            : 0U;

  if (g_cs_session_open != 0U) {
    flags |= 0x01U;
  }
  if (g_cs_procedure_enabled != 0U) {
    flags |= 0x02U;
  }
  if (g_pending_cs_result_stage != 0U) {
    flags |= 0x04U;
  }
  if (g_cs_peer_exchange_stage == VPR_CS_PEER_STAGE_PROCEDURE_ACTIVE) {
    flags |= 0x08U;
  }
  if (g_cs_builtin_peer_demo_enabled != 0U) {
    flags |= 0x10U;
  }
  if (g_cs_test_active != 0U) {
    flags |= 0x20U;
  }
  if (ready != 0U) {
    flags |= 0x40U;
  }

  payload[0] = status;
  payload[1] = flags;
  payload[2] = active_subevent;
  payload[3] = subevent_count;
  payload[4] = total_steps;
  payload[5] = subevent_start;
  payload[6] = subevent_steps;
  payload[7] = g_cs_local_chunk_start_step;
  payload[8] = g_cs_peer_chunk_start_step;
  payload[9] = interval_selector;
  write_le16(&payload[10], g_cs_procedure_counter);
  write_le16(&payload[12], g_cs_session_conn_handle);
  payload[14] = g_cs_config_id;
  payload[15] = g_cs_last_peer_gap_ticks;
  write_le16(&payload[16], subevent_bytes);
  write_le32(&payload[18], g_vpr_transport->heartbeat);
  write_le32(&payload[22], procedure_interval_ticks);
  write_le32(&payload[26], current_subevent_stage_delay_ticks());
  write_le32(&payload[30], current_peer_stage_delay_ticks());
  write_le32(&payload[34], current_chunk_stage_delay_ticks());
  write_le32(&payload[38], g_cs_next_procedure_heartbeat);
  write_le32(&payload[42], g_cs_next_subevent_heartbeat);
  write_le32(&payload[46], g_cs_next_peer_stage_heartbeat);
  write_le32(&payload[50], g_cs_next_chunk_stage_heartbeat);
  payload[54] = ready;
  payload[55] = fill_demo_channels_for_procedure(step_channels, phase_step_count);
  for (uint8_t i = 0U; i < 6U; ++i) {
    payload[56U + i] = step_channels[i];
  }
  return 62U;
}

static uint32_t build_measurement_execute_token(uint8_t config_id,
                                                uint16_t procedure_counter,
                                                uint16_t conn_handle,
                                                uint8_t active_subevent,
                                                uint8_t subevent_count,
                                                uint8_t total_steps,
                                                uint8_t subevent_start,
                                                uint8_t subevent_steps,
                                                uint8_t step_channel_count,
                                                const uint8_t *step_channels,
                                                uint32_t execute_count) {
  uint32_t hash = 2166136261UL;
  hash ^= 0xC5U; hash *= 16777619UL;
  hash ^= (uint32_t)config_id; hash *= 16777619UL;
  hash ^= (uint32_t)(procedure_counter & 0xFFU); hash *= 16777619UL;
  hash ^= (uint32_t)((procedure_counter >> 8U) & 0xFFU); hash *= 16777619UL;
  hash ^= (uint32_t)(conn_handle & 0xFFU); hash *= 16777619UL;
  hash ^= (uint32_t)((conn_handle >> 8U) & 0xFFU); hash *= 16777619UL;
  hash ^= (uint32_t)active_subevent; hash *= 16777619UL;
  hash ^= (uint32_t)subevent_count; hash *= 16777619UL;
  hash ^= (uint32_t)total_steps; hash *= 16777619UL;
  hash ^= (uint32_t)subevent_start; hash *= 16777619UL;
  hash ^= (uint32_t)subevent_steps; hash *= 16777619UL;
  hash ^= (uint32_t)step_channel_count; hash *= 16777619UL;
  for (uint8_t i = 0U; i < 6U; ++i) {
    const uint8_t value = (step_channels != NULL) ? step_channels[i] : 0U;
    hash ^= (uint32_t)value;
    hash *= 16777619UL;
  }
  for (uint8_t i = 0U; i < 4U; ++i) {
    hash ^= (uint32_t)((execute_count >> (8U * i)) & 0xFFU);
    hash *= 16777619UL;
  }
  hash ^= 0U;
  hash *= 16777619UL;
  hash ^= 0U;
  hash *= 16777619UL;
  return hash;
}

static uint32_t build_measurement_rf_descriptor_token(uint8_t config_id,
                                                      uint16_t procedure_counter,
                                                      uint16_t conn_handle,
                                                      uint8_t active_subevent,
                                                      uint8_t subevent_count,
                                                      uint8_t total_steps,
                                                      uint8_t subevent_start,
                                                      uint8_t subevent_steps,
                                                      uint8_t step_channel_count,
                                                      const uint8_t *step_channels,
                                                      uint8_t role,
                                                      uint8_t phy,
                                                      int8_t tx_power_delta,
                                                      uint8_t rtt_type,
                                                      uint32_t min_subevent_len,
                                                      uint32_t max_subevent_len,
                                                      uint32_t execute_count) {
  uint32_t hash = 2166136261UL;
  hash ^= 0xC6U; hash *= 16777619UL;
  hash ^= (uint32_t)config_id; hash *= 16777619UL;
  hash ^= (uint32_t)(procedure_counter & 0xFFU); hash *= 16777619UL;
  hash ^= (uint32_t)((procedure_counter >> 8U) & 0xFFU); hash *= 16777619UL;
  hash ^= (uint32_t)(conn_handle & 0xFFU); hash *= 16777619UL;
  hash ^= (uint32_t)((conn_handle >> 8U) & 0xFFU); hash *= 16777619UL;
  hash ^= (uint32_t)active_subevent; hash *= 16777619UL;
  hash ^= (uint32_t)subevent_count; hash *= 16777619UL;
  hash ^= (uint32_t)total_steps; hash *= 16777619UL;
  hash ^= (uint32_t)subevent_start; hash *= 16777619UL;
  hash ^= (uint32_t)subevent_steps; hash *= 16777619UL;
  hash ^= (uint32_t)step_channel_count; hash *= 16777619UL;
  for (uint8_t i = 0U; i < 6U; ++i) {
    const uint8_t value = (step_channels != NULL) ? step_channels[i] : 0U;
    hash ^= (uint32_t)value;
    hash *= 16777619UL;
  }
  hash ^= (uint32_t)role; hash *= 16777619UL;
  hash ^= (uint32_t)phy; hash *= 16777619UL;
  hash ^= (uint32_t)((uint8_t)tx_power_delta); hash *= 16777619UL;
  hash ^= (uint32_t)rtt_type; hash *= 16777619UL;
  for (uint8_t i = 0U; i < 4U; ++i) {
    hash ^= (uint32_t)((min_subevent_len >> (8U * i)) & 0xFFU);
    hash *= 16777619UL;
  }
  for (uint8_t i = 0U; i < 4U; ++i) {
    hash ^= (uint32_t)((max_subevent_len >> (8U * i)) & 0xFFU);
    hash *= 16777619UL;
  }
  for (uint8_t i = 0U; i < 4U; ++i) {
    hash ^= (uint32_t)((execute_count >> (8U * i)) & 0xFFU);
    hash *= 16777619UL;
  }
  hash ^= 0U; hash *= 16777619UL;
  hash ^= 0U; hash *= 16777619UL;
  return hash;
}

static uint32_t build_measurement_rf_hardware_token(uint8_t version,
                                                    uint8_t flags,
                                                    uint32_t radio_state,
                                                    uint32_t radio_mode,
                                                    uint32_t radio_frequency) {
  return 0xC7000000UL ^
         radio_state ^
         (radio_mode << 1U) ^
         (radio_frequency << 2U) ^
         ((uint32_t)flags << 16U) ^
         (uint32_t)version;
}

