lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
  *out_observed_frequency = read_radio_register(VPR_NRF_RADIO_FREQUENCY_OFFSET);
  *out_observed_datawhite = read_radio_register(VPR_NRF_RADIO_DATAWHITE_OFFSET);
  *out_status =
      (*out_observed_frequency == *out_target_frequency &&
       *out_observed_datawhite == *out_target_datawhite)
          ? VPR_RF_RETUNE_STATUS_OK
          : VPR_RF_RETUNE_STATUS_VERIFY_FAILED;
  *out_token = build_measurement_rf_retune_token(
      version, *out_flags, *out_status, channel, *out_target_frequency,
      *out_target_datawhite, *out_observed_frequency,
      *out_observed_datawhite);
}

static void execute_rf_rx_ready_disable_primitive(uint8_t accepted,
                                                  uint8_t version,
                                                  uint8_t *out_flags,
                                                  uint8_t *out_status,
                                                  uint32_t *out_state_before,
                                                  uint32_t *out_rxready_wait_loops,
                                                  uint32_t *out_disable_wait_loops,
                                                  uint32_t *out_state_after,
                                                  uint32_t *out_token) {
  if (out_flags == NULL || out_status == NULL ||
      out_state_before == NULL || out_rxready_wait_loops == NULL ||
      out_disable_wait_loops == NULL || out_state_after == NULL ||
      out_token == NULL) {
    return;
  }

  *out_flags = 0U;
  *out_status = VPR_RF_RX_PRIMITIVE_STATUS_NOT_ACCEPTED;
  *out_state_before = read_radio_register(VPR_NRF_RADIO_STATE_OFFSET);
  *out_rxready_wait_loops = 0U;
  *out_disable_wait_loops = 0U;
  *out_state_after = *out_state_before;
  *out_token = 0U;

  if (accepted == 0U) {
    return;
  }

  *out_flags = VPR_RF_RX_PRIMITIVE_FLAG_VALID;
  if (*out_state_before != 0U) {
    *out_status = VPR_RF_RX_PRIMITIVE_STATUS_RADIO_BUSY;
    *out_token = build_measurement_rf_primitive_token(
        version, *out_flags, *out_status, *out_state_before,
        *out_rxready_wait_loops, *out_disable_wait_loops, *out_state_after);
    return;
  }

  write_radio_register(VPR_NRF_RADIO_EVENTS_RXREADY_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET, 0U);
  write_radio_register(VPR_NRF_RADIO_TASKS_RXEN_OFFSET, 1U);

  while (read_radio_register(VPR_NRF_RADIO_EVENTS_RXREADY_OFFSET) == 0U &&
         *out_rxready_wait_loops < VPR_RF_RX_PRIMITIVE_RXREADY_WAIT_MAX_LOOPS) {
    *out_rxready_wait_loops = *out_rxready_wait_loops + 1U;
  }

  if (read_radio_register(VPR_NRF_RADIO_EVENTS_RXREADY_OFFSET) != 0U) {
    *out_flags |= VPR_RF_RX_PRIMITIVE_FLAG_RX_READY;
  }

  write_radio_register(VPR_NRF_RADIO_TASKS_DISABLE_OFFSET, 1U);
  while (read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) == 0U &&
         *out_disable_wait_loops < VPR_RF_RX_PRIMITIVE_DISABLE_WAIT_MAX_LOOPS) {
    *out_disable_wait_loops = *out_disable_wait_loops + 1U;
  }

  if (read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) != 0U) {
    *out_flags |= VPR_RF_RX_PRIMITIVE_FLAG_DISABLED;
  }

  *out_state_after = read_radio_register(VPR_NRF_RADIO_STATE_OFFSET);
  if ((*out_flags & VPR_RF_RX_PRIMITIVE_FLAG_RX_READY) == 0U) {
    *out_status = VPR_RF_RX_PRIMITIVE_STATUS_RXREADY_TIMEOUT;
  } else if ((*out_flags & VPR_RF_RX_PRIMITIVE_FLAG_DISABLED) == 0U ||
             *out_state_after != 0U) {
    *out_status = VPR_RF_RX_PRIMITIVE_STATUS_DISABLE_TIMEOUT;
  } else {
    *out_status = VPR_RF_RX_PRIMITIVE_STATUS_OK;
  }

  *out_token = build_measurement_rf_primitive_token(
      version, *out_flags, *out_status, *out_state_before,
      *out_rxready_wait_loops, *out_disable_wait_loops, *out_state_after);
}

static size_t build_vendor_ble_cs_measurement_execute_complete_payload(uint8_t *payload,
                                                                       size_t max_len) {
  if (payload == NULL || max_len < 152U) {
    return 0U;
  }

  uint8_t step_channels[6] = {0};
  const uint8_t active_subevent = g_cs_active_subevent_index;
  const uint8_t subevent_count = current_demo_subevent_count();
  const uint8_t total_steps = current_demo_total_step_count();
  const uint8_t phase_step_count = current_demo_step_count();
  const uint8_t subevent_start = current_demo_subevent_start_step(active_subevent);
  const uint8_t subevent_steps = current_demo_subevent_step_count(active_subevent);
  const uint8_t step_channel_count =
      fill_demo_channels_for_procedure(step_channels, phase_step_count);
  const uint8_t rf_descriptor_version = 1U;
  const uint8_t rf_descriptor_valid = 1U;
  const uint8_t rf_hardware_version = 1U;
  const uint8_t rf_primitive_version = 1U;
  const uint8_t rf_retune_version = 1U;
  const uint8_t rf_rx_primitive_version = 1U;
  uint8_t rf_hardware_flags = 0U;
  uint32_t rf_hardware_state = 0U;
  uint32_t rf_hardware_mode = 0U;
  uint32_t rf_hardware_frequency = 0U;
  uint32_t rf_hardware_token = 0U;
  uint8_t rf_primitive_flags = 0U;
  uint8_t rf_primitive_status = VPR_RF_PRIMITIVE_STATUS_NOT_ACCEPTED;
  uint32_t rf_primitive_state_before = 0U;
  uint32_t rf_primitive_pll_wait_loops = 0U;
  uint32_t rf_primitive_disable_wait_loops = 0U;
  uint32_t rf_primitive_state_after = 0U;
  uint32_t rf_primitive_token = 0U;
  uint8_t rf_retune_flags = 0U;
  uint8_t rf_retune_status = VPR_RF_RETUNE_STATUS_NOT_ACCEPTED;
  uint32_t rf_retune_target_frequency = 0U;
  uint32_t rf_retune_target_datawhite = 0U;
  uint32_t rf_retune_observed_frequency = 0U;
  uint32_t rf_retune_observed_datawhite = 0U;
  uint32_t rf_retune_token = 0U;
  uint8_t rf_rx_primitive_flags = 0U;
  uint8_t rf_rx_primitive_status = VPR_RF_RX_PRIMITIVE_STATUS_NOT_ACCEPTED;
  uint32_t rf_rx_primitive_state_before = 0U;
  uint32_t rf_rx_primitive_rxready_wait_loops = 0U;
  uint32_t rf_rx_primitive_disable_wait_loops = 0U;
  uint32_t rf_rx_primitive_state_after = 0U;
  uint32_t rf_rx_primitive_token = 0U;
  uint32_t rf_packet_config_token = 0U;
  const uint32_t rf_descriptor_token = build_measurement_rf_descriptor_token(
      g_cs_config_id, g_cs_procedure_counter, g_cs_session_conn_handle,
      active_subevent, subevent_count, total_steps, subevent_start,
      subevent_steps, step_channel_count, step_channels, g_cs_role,
      g_cs_cs_sync_phy, g_cs_tx_power_delta, g_cs_rtt_type,
      g_cs_min_subevent_len, g_cs_max_subevent_len,
      g_cs_measurement_execute_count + 1U);
  const uint8_t ready = (g_cs_session_open != 0U &&
                         g_cs_procedure_counter != 0U &&
                         g_cs_config_id != 0U &&
                         total_steps != 0U &&
                         subevent_count != 0U &&
                         subevent_steps != 0U &&
                         step_channel_count != 0U)
                            ? 1U
                            : 0U;
  const bool default_packet_layout = command_layout_is_exact(0U);
  const bool host_packet_layout = command_layout_is_exact(2U);
  uint8_t packet_s0 = VPR_CS_PACKET_S0_PATTERN;
  uint8_t packet_cte_info = VPR_CS_PACKET_CTE_TIME_UNITS & 0x1FU;
  if (host_packet_layout) {
    packet_s0 = g_host_transport->hostData[4];
    packet_cte_info = g_host_transport->hostData[5] & 0x1FU;
  }
  uint8_t status = (default_packet_layout || host_packet_layout)
                       ? BLE_CS_HCI_STATUS_SUCCESS
                       : BLE_CS_HCI_STATUS_INVALID_PARAMS;
  uint8_t accepted = 0U;
  if (status == BLE_CS_HCI_STATUS_SUCCESS && ready == 0U) {
    status = BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (status == BLE_CS_HCI_STATUS_SUCCESS) {
    accepted = 1U;
    g_cs_measurement_execute_count = g_cs_measurement_execute_count + 1U;
    g_cs_measurement_execute_last_channels = step_channel_count;
    g_cs_measurement_execute_last_token = build_measurement_execute_token(
        g_cs_config_id, g_cs_procedure_counter, g_cs_session_conn_handle,
        active_subevent, subevent_count, total_steps, subevent_start,
        subevent_steps, step_channel_count, step_channels,
        g_cs_measurement_execute_count);
    execute_rf_channel_retune_primitive(
        accepted, rf_retune_version,
        (step_channel_count != 0U) ? step_channels[0] : 0xFFU,
        &rf_retune_flags, &rf_retune_status, &rf_retune_target_frequency,
        &rf_retune_target_datawhite, &rf_retune_observed_frequency,
        &rf_retune_observed_datawhite, &rf_retune_token);
    execute_rf_rx_ready_disable_primitive(
        accepted, rf_rx_primitive_version, &rf_rx_primitive_flags,
        &rf_rx_primitive_status, &rf_rx_primitive_state_before,
        &rf_rx_primitive_rxready_wait_loops,
        &rf_rx_primitive_disable_wait_loops,
        &rf_rx_primitive_state_after, &rf_rx_primitive_token);
    const uint32_t previous_pcnf0 =
        read_radio_register(VPR_NRF_RADIO_PCNF0_OFFSET);
    const uint32_t previous_pcnf1 =
        read_radio_register(VPR_NRF_RADIO_PCNF1_OFFSET);
    write_radio_register(VPR_NRF_RADIO_PCNF0_OFFSET,
                         VPR_RADIO_PACKET_PCNF0_DEFAULT);
    write_radio_register(VPR_NRF_RADIO_PCNF1_OFFSET,
                         VPR_RADIO_PACKET_PCNF1_DEFAULT);
    uint8_t packet_config_flags =
        VPR_RF_PACKET_CONFIG_FLAG_VALID |
        VPR_RF_PACKET_CONFIG_FLAG_PACKET_WRITTEN;
    const uint8_t packet_channel =
        (step_channel_count != 0U) ? step_channels[0] : 0xFFU;
    if (vpr_valid_data_channel(packet_channel)) {
      const uint32_t packet_ptr = (uint32_t)(uintptr_t)g_vpr_cs_packet_buffer;
      const uint32_t previous_packet_ptr =
          read_radio_register(VPR_NRF_RADIO_PACKETPTR_OFFSET);
      g_vpr_cs_packet_buffer[0] = packet_s0;
      g_vpr_cs_packet_buffer[1] = VPR_CS_PACKET_PAYLOAD_LEN;
      g_vpr_cs_packet_buffer[2] = packet_cte_info;
      g_vpr_cs_packet_buffer[3] = VPR_CS_PACKET_MAGIC0;
      g_vpr_cs_packet_buffer[4] = VPR_CS_PACKET_MAGIC1;
      g_vpr_cs_packet_buffer[5] = VPR_CS_PACKET_TYPE_PROBE;
      g_vpr_cs_packet_buffer[6] =
          (uint8_t)(g_cs_measurement_execute_count & 0xFFU);
      g_vpr_cs_packet_buffer[7] = packet_channel;
      g_vpr_cs_packet_buffer[8] = 0U;
      const uint32_t previous_shorts =
          read_radio_register(VPR_NRF_RADIO_SHORTS_OFFSET);
      write_radio_register(VPR_NRF_RADIO_PACKETPTR_OFFSET, packet_ptr);
      if (read_radio_register(VPR_NRF_RADIO_PACKETPTR_OFFSET) == packet_ptr) {
        packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_PACKETPTR_WRITTEN;
      }
      if (read_radio_register(VPR_NRF_RADIO_STATE_OFFSET) == 0U) {
        uint32_t tx_disable_wait_loops = 0U;
        write_radio_register(VPR_NRF_RADIO_SHORTS_OFFSET,
                             VPR_NRF_RADIO_SHORTS_TXREADY_START_Msk |
                             VPR_NRF_RADIO_SHORTS_PHYEND_DISABLE_Msk);
        write_radio_register(VPR_NRF_RADIO_EVENTS_TXREADY_OFFSET, 0U);
        write_radio_register(VPR_NRF_RADIO_EVENTS_END_OFFSET, 0U);
        write_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET, 0U);
        write_radio_register(VPR_NRF_RADIO_TASKS_TXEN_OFFSET, 1U);
        while (read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) == 0U &&
               tx_disable_wait_loops < VPR_RF_RX_PRIMITIVE_DISABLE_WAIT_MAX_LOOPS) {
          tx_disable_wait_loops = tx_disable_wait_loops + 1U;
        }
        if (read_radio_register(VPR_NRF_RADIO_EVENTS_TXREADY_OFFSET) != 0U) {
          packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_TX_READY |
                                 VPR_RF_PACKET_CONFIG_FLAG_TX_STARTED;
        }
        if (read_radio_register(VPR_NRF_RADIO_EVENTS_END_OFFSET) != 0U) {
          packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_TX_END;
        }
        if (read_radio_register(VPR_NRF_RADIO_EVENTS_DISABLED_OFFSET) != 0U &&
            read_radio_register(VPR_NRF_RADIO_STATE_OFFSET) == 0U) {
          packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_TX_DISABLED;
        }
        write_radio_register(VPR_NRF_RADIO_SHORTS_OFFSET, previous_shorts);
      }
      write_radio_register(VPR_NRF_RADIO_PACKETPTR_OFFSET,
                           previous_packet_ptr);
      if (read_radio_register(VPR_NRF_RADIO_PACKETPTR_OFFSET) ==
          previous_packet_ptr) {
        packet_config_flags |= VPR_RF_PACKET_CONFIG_FLAG_PACKETPTR_RESTORED;
      }
    }
    write_radio_register(VPR_NRF_RADIO_PCNF0_OFFSET, previous_pcnf0);
    write_radio_register(VPR_NRF_RADIO_PCNF1_OFFSET, previous_pcnf1);
    rf_packet_config_token =
        VPR_RADIO_PACKET_PCNF0_DEFAULT ^
        (VPR_RADIO_PACKET_PCNF1_DEFAULT << 1U) ^
        ((uint32_t)packet_config_flags << 16U) ^
        ((uint32_t)packet_s0 << 2U) ^
        ((uint32_t)VPR_CS_PACKET_PAYLOAD_LEN << 5U) ^
        ((uint32_t)packet_cte_info << 9U) ^
        ((uint32_t)VPR_CS_PACKET_MAGIC0 << 11U) ^
        ((uint32_t)VPR_CS_PACKET_MAGIC1 << 15U) ^
        ((uint32_t)VPR_CS_PACKET_TYPE_PROBE << 13U) ^
        ((uint32_t)(g_cs_measurement_execute_count & 0xFFU) << 17U) ^
        ((uint32_t)packet_channel << 21U) ^
        1U;
    rf_hardware_flags = 0x01U;
    read_rf_hardware_snapshot(rf_hardware_version, rf_hardware_flags,
                              &rf_hardware_state, &rf_hardware_mode,
                              &rf_hardware_frequency, &rf_hardware_token);
    execute_rf_pll_disable_primitive(
        accepted, rf_primitive_version, &rf_primitive_flags,
        &rf_primitive_status, &rf_primitive_state_before,
        &rf_primitive_pll_wait_loops, &rf_primitive_disable_wait_loops,
        &rf_primitive_state_after, &rf_primitive_token);
  } else {
    g_cs_measurement_execute_last_channels = 0U;
    g_cs_measurement_execute_last_token = 0U;
  }
  g_cs_measurement_execute_last_status = status;

  uint8_t flags = 0U;
  if (ready != 0U) {
    flags |= 0x01U;
  }
  if (accepted != 0U) {
    flags |= 0x02U;
  }
  if (g_pending_cs_result_stage != 0U) {
    flags |= 0x04U;
  }
  if (g_cs_peer_exchange_stage == VPR_CS_PEER_STAGE_PROCEDURE_ACTIVE) {
    flags |= 0x08U;
  }

