lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
  payload[0] = status;
  payload[1] = flags;
  payload[2] = active_subevent;
  payload[3] = subevent_count;
  payload[4] = total_steps;
  payload[5] = subevent_start;
  payload[6] = subevent_steps;
  payload[7] = g_cs_config_id;
  payload[8] = step_channel_count;
  payload[9] = accepted != 0U ? step_channel_count : 0U;
  write_le16(&payload[10], g_cs_procedure_counter);
  write_le16(&payload[12], g_cs_session_conn_handle);
  write_le32(&payload[14], g_vpr_transport->heartbeat);
  write_le32(&payload[18], g_cs_measurement_execute_count);
  for (uint8_t i = 0U; i < 6U; ++i) {
    payload[22U + i] = step_channels[i];
  }
  payload[28] = g_cs_measurement_execute_last_status;
  payload[29] = g_cs_measurement_execute_last_channels;
  payload[30] = (uint8_t)(rf_packet_config_token & 0xFFU);
  payload[31] = (uint8_t)((rf_packet_config_token >> 8U) & 0xFFU);
  write_le32(&payload[32], g_cs_measurement_execute_last_token);
  payload[36] = rf_descriptor_version;
  payload[37] = (rf_descriptor_valid != 0U) ? 0x01U : 0x00U;
  payload[38] = g_cs_role;
  payload[39] = g_cs_cs_sync_phy;
  payload[40] = (uint8_t)g_cs_tx_power_delta;
  payload[41] = g_cs_rtt_type;
  payload[42] = step_channel_count;
  payload[43] = 0U;
  write_le32(&payload[44], g_cs_min_subevent_len);
  write_le32(&payload[48], g_cs_max_subevent_len);
  write_le32(&payload[52], g_cs_next_subevent_heartbeat);
  write_le32(&payload[56], (accepted != 0U) ? rf_descriptor_token : 0U);
  payload[60] = rf_hardware_version;
  payload[61] = (accepted != 0U) ? rf_hardware_flags : 0U;
  payload[62] = (uint8_t)((rf_packet_config_token >> 16U) & 0xFFU);
  payload[63] = (uint8_t)((rf_packet_config_token >> 24U) & 0xFFU);
  write_le32(&payload[64], rf_hardware_state);
  write_le32(&payload[68], rf_hardware_mode);
  write_le32(&payload[72], rf_hardware_frequency);
  write_le32(&payload[76], (accepted != 0U) ? rf_hardware_token : 0U);
  payload[80] = rf_primitive_version;
  payload[81] = (accepted != 0U) ? rf_primitive_flags : 0U;
  payload[82] = (accepted != 0U) ? rf_primitive_status
                                 : VPR_RF_PRIMITIVE_STATUS_NOT_ACCEPTED;
  payload[83] = 0U;
  write_le32(&payload[84], rf_primitive_state_before);
  write_le32(&payload[88], rf_primitive_pll_wait_loops);
  write_le32(&payload[92], rf_primitive_disable_wait_loops);
  write_le32(&payload[96], rf_primitive_state_after);
  write_le32(&payload[100], (accepted != 0U) ? rf_primitive_token : 0U);
  payload[104] = rf_retune_version;
  payload[105] = (accepted != 0U) ? rf_retune_flags : 0U;
  payload[106] = (accepted != 0U) ? rf_retune_status
                                  : VPR_RF_RETUNE_STATUS_NOT_ACCEPTED;
  payload[107] = (step_channel_count != 0U) ? step_channels[0] : 0xFFU;
  write_le32(&payload[108], rf_retune_target_frequency);
  write_le32(&payload[112], rf_retune_target_datawhite);
  write_le32(&payload[116], rf_retune_observed_frequency);
  write_le32(&payload[120], rf_retune_observed_datawhite);
  write_le32(&payload[124], (accepted != 0U) ? rf_retune_token : 0U);
  payload[128] = rf_rx_primitive_version;
  payload[129] = (accepted != 0U) ? rf_rx_primitive_flags : 0U;
  payload[130] = (accepted != 0U) ? rf_rx_primitive_status
                                  : VPR_RF_RX_PRIMITIVE_STATUS_NOT_ACCEPTED;
  payload[131] = 0U;
  write_le32(&payload[132], rf_rx_primitive_state_before);
  write_le32(&payload[136], rf_rx_primitive_rxready_wait_loops);
  write_le32(&payload[140], rf_rx_primitive_disable_wait_loops);
  write_le32(&payload[144], rf_rx_primitive_state_after);
  write_le32(&payload[148], (accepted != 0U) ? rf_rx_primitive_token : 0U);
  return 152U;
}

static size_t build_vendor_ble_cs_tone_snapshot_complete_payload(uint8_t *payload,
                                                                 size_t max_len) {
  if (payload == NULL || max_len < 32U) {
    return 0U;
  }

  const uint8_t version = 1U;
  const uint8_t status = command_layout_is_exact(0U)
                             ? BLE_CS_HCI_STATUS_SUCCESS
                             : BLE_CS_HCI_STATUS_INVALID_PARAMS;
  const uint32_t frequency = read_radio_register(VPR_NRF_RADIO_FREQUENCY_OFFSET);
  const uint32_t state = read_radio_register(VPR_NRF_RADIO_STATE_OFFSET);
  const uint32_t dfe_packet_ptr =
      read_radio_register(VPR_NRF_RADIO_DFEPACKET_PTR_OFFSET);
  const uint32_t dfe_packet_amount =
      read_radio_register(VPR_NRF_RADIO_DFEPACKET_AMOUNT_OFFSET);
  const uint32_t dfe_packet_current_amount =
      read_radio_register(VPR_NRF_RADIO_DFEPACKET_CURRENTAMOUNT_OFFSET);
  const uint32_t dfe_packet_hash =
      hash_dfe_packet_bytes(dfe_packet_ptr, dfe_packet_current_amount);

  uint8_t flags = 0U;
  if (status == BLE_CS_HCI_STATUS_SUCCESS) {
    flags |= VPR_TONE_SNAPSHOT_FLAG_VALID;
  }
  const uint32_t cstones_end_event =
      read_radio_register(VPR_NRF_RADIO_EVENTS_CSTONESEND_OFFSET);
  uint32_t pct16 = read_radio_register(VPR_NRF_RADIO_CSTONES_PCT16_OFFSET);
  uint32_t mag_phase =
      read_radio_register(VPR_NRF_RADIO_CSTONES_MAGPHASEMEAN_OFFSET);
  uint32_t mag_std =
      read_radio_register(VPR_NRF_RADIO_CSTONES_MAGSTD_OFFSET);
  const bool cstones_nonzero = (pct16 != 0U || mag_phase != 0U || mag_std != 0U);
  const bool dfe_nonzero =
      (dfe_packet_amount != 0U || dfe_packet_current_amount != 0U ||
       dfe_packet_hash != 0U);
  if (!cstones_nonzero && dfe_nonzero) {
    pct16 = dfe_packet_amount;
    mag_phase = dfe_packet_current_amount;
    mag_std = dfe_packet_hash;
    flags |= VPR_TONE_SNAPSHOT_FLAG_DFE_PACKET;
  }
  if (cstones_nonzero || dfe_nonzero) {
    flags |= VPR_TONE_SNAPSHOT_FLAG_NONZERO_SAMPLE;
  }
  if (state == 0U) {
    flags |= VPR_TONE_SNAPSHOT_FLAG_RADIO_DISABLED;
  }
  if (read_radio_register(VPR_NRF_RADIO_CSTONES_MODE_OFFSET) == 1U &&
      read_radio_register(VPR_NRF_RADIO_CSTONES_DOWNSAMPLE_OFFSET) == 2U) {
    flags |= VPR_TONE_SNAPSHOT_FLAG_TONE_CONFIG;
  }

  const uint32_t token =
      (status == BLE_CS_HCI_STATUS_SUCCESS)
          ? build_measurement_tone_snapshot_token(version, flags, status, pct16,
                                                  mag_phase, mag_std, frequency,
                                                  state, cstones_end_event)
          : 0U;
  payload[0] = status;
  payload[1] = flags;
  payload[2] = version;
  payload[3] = 0U;
  write_le32(&payload[4], pct16);
  write_le32(&payload[8], mag_phase);
  write_le32(&payload[12], mag_std);
  write_le32(&payload[16], frequency);
  write_le32(&payload[20], state);
  write_le32(&payload[24], cstones_end_event);
  write_le32(&payload[28], token);
  return 32U;
}

#endif

static bool publish_builtin_response_for_opcode(uint16_t opcode) {
  /* Largest staging payload is the fixed 152-byte CS execute response. */
  uint8_t payload[152];
  uint16_t conn_handle = current_conn_handle();
  size_t offset = 0U;
  zero_vpr_data();

