lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
  switch (opcode) {
    case BLE_CS_HCI_OP_READ_REMOTE_SUPPORTED_CAPABILITIES: {
      uint8_t status = 0U;
#if VPR_CS_DEDICATED_IMAGE
      status = validate_read_remote_caps_command();
      if (status == BLE_CS_HCI_STATUS_SUCCESS && g_cs_session_open == 0U) {
        clear_active_cs_state();
        g_cs_session_conn_handle = conn_handle;
        g_cs_session_open = 1U;
      }
#endif
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
      len = build_remote_caps_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_READ_REMOTE_SUPPORTED_CAPS_COMPLETE_V2, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_SET_DEFAULT_SETTINGS: {
#if VPR_CS_DEDICATED_IMAGE
      update_defaults_from_set_default_settings();
#endif
      size_t len = append_h4_command_complete((uint8_t *)g_vpr_transport->vprData + offset,
                                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                              opcode, 0U);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_WRITE_CACHED_REMOTE_SUPPORTED_CAPABILITIES:
    case BLE_CS_HCI_OP_WRITE_CACHED_REMOTE_SUPPORTED_CAPABILITIES_V2: {
      const size_t payload_len =
          opcode == BLE_CS_HCI_OP_WRITE_CACHED_REMOTE_SUPPORTED_CAPABILITIES ? 30U : 33U;
      const uint8_t status = validate_conn_scoped_command(payload_len);
      size_t len = append_h4_command_complete(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_READ_REMOTE_FAE_TABLE: {
      const uint8_t status = validate_conn_scoped_command(2U);
      size_t len = append_h4_command_status(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != BLE_CS_HCI_STATUS_SUCCESS) {
        break;
      }
      len = build_remote_fae_payload(payload, sizeof(payload), conn_handle, status);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
          BLE_CS_HCI_EVT_READ_REMOTE_FAE_TABLE_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_WRITE_CACHED_REMOTE_FAE_TABLE: {
      const uint8_t status =
          validate_conn_scoped_command(2U + BLE_CS_FAE_TABLE_LEN);
      size_t len = append_h4_command_complete(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_CREATE_CONFIG: {
      uint8_t status = 0U;
#if VPR_CS_DEDICATED_IMAGE
      status = validate_create_config_command();
      if (status == 0U) {
        update_create_config_from_command();
      }
#endif
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
      len = build_config_complete_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_CONFIG_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
#if VPR_CS_DEDICATED_IMAGE
      g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_AWAITING_CS_RSP;
      g_cs_peer_exchange_deadline =
          peer_deadline_for_stage(g_cs_peer_exchange_stage);
#endif
      break;
    }
    case BLE_CS_HCI_OP_REMOVE_CONFIG: {
      uint8_t status = 0U;
      uint8_t removed_config_id = 0U;
#if VPR_CS_DEDICATED_IMAGE
      bool removed_active_config = false;
      status = validate_remove_config_command();
      if (status == 0U) {
        removed_config_id = g_host_transport->hostData[6];
        removed_active_config = (removed_config_id == g_cs_config_id);
        if (removed_active_config) {
          clear_active_config_selection();
        }
        clear_cs_slots_for_config(removed_config_id);
        if (!any_cs_slot_in_use()) {
          clear_active_cs_state();
        } else if (removed_active_config && !activate_first_stored_config_slot()) {
          clear_active_cs_state();
        }
      }
#endif
      size_t len = append_h4_command_complete((uint8_t *)g_vpr_transport->vprData + offset,
                                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                              opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
      len = build_remove_config_complete_payload(payload, sizeof(payload), conn_handle,
#if VPR_CS_DEDICATED_IMAGE
                                                 removed_config_id
#else
                                                 1U
#endif
      );
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_CONFIG_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_SECURITY_ENABLE: {
      uint8_t status = 0U;
#if VPR_CS_DEDICATED_IMAGE
      vpr_cs_config_slot_t *slot = NULL;
      status = validate_security_enable_command();
#endif
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
#if VPR_CS_DEDICATED_IMAGE
      g_cs_security_enabled = 1U;
      slot = find_cs_slot(g_cs_config_id);
      if (slot != NULL) {
        slot->securityEnabled = 1U;
      }
#endif
      len = build_security_complete_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_SECURITY_ENABLE_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
#if VPR_CS_DEDICATED_IMAGE
      g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_AWAITING_SEC_RSP;
      g_cs_peer_exchange_deadline =
          peer_deadline_for_stage(g_cs_peer_exchange_stage);
#endif
      break;
    }
    case BLE_CS_HCI_OP_SET_CHANNEL_CLASSIFICATION: {
      const uint8_t status =
          command_layout_is_exact(BLE_CS_CHANNEL_CLASSIFICATION_LEN)
              ? BLE_CS_HCI_STATUS_SUCCESS
              : BLE_CS_HCI_STATUS_INVALID_PARAMS;
      size_t len = append_h4_command_complete(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_SET_PROCEDURE_PARAMETERS: {
      uint8_t status = 0U;
#if VPR_CS_DEDICATED_IMAGE
      status = validate_set_procedure_params_command();
      if (status == 0U) {
        update_procedure_params_from_command();
      }
#endif
      size_t len = append_h4_command_complete((uint8_t *)g_vpr_transport->vprData + offset,
                                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                              opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
#if VPR_CS_DEDICATED_IMAGE
      g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_AWAITING_PROC_RSP;
      g_cs_peer_exchange_deadline =
          peer_deadline_for_stage(g_cs_peer_exchange_stage);
#endif
      break;
    }
    case BLE_CS_HCI_OP_PROCEDURE_ENABLE: {
      uint8_t status = 0U;
      uint8_t enable = 0U;
#if VPR_CS_DEDICATED_IMAGE
      status = validate_procedure_enable_command();
      if (g_host_transport->hostLen >= 8U) {
        const uint8_t requested_config_id = g_host_transport->hostData[6];
        vpr_cs_config_slot_t *slot = find_cs_slot(requested_config_id);
        const bool slot_in_previous = (slot == &g_cs_previous_slot);
        enable = g_host_transport->hostData[7];
        if (status == 0U && enable != 0U && requested_config_id != g_cs_config_id) {
          if (slot_in_previous) {
            slot = promote_previous_slot_to_primary(true);
            if (slot == NULL || !load_active_state_from_slot(slot)) {
              status = BLE_CS_HCI_STATUS_INVALID_PARAMS;
            } else {
              clear_active_runtime_state();
            }
          } else {
            (void)activate_stored_config_slot(requested_config_id, true);
            slot = find_cs_slot(requested_config_id);
          }
        } else if (status == 0U && slot != NULL) {
          if (enable != 0U && slot_in_previous) {
            slot = promote_previous_slot_to_primary(true);
            if (slot == NULL) {
              status = BLE_CS_HCI_STATUS_INVALID_PARAMS;
            }
          }
          if (status == 0U) {
            (void)load_active_state_from_slot(slot);
          }
        }
        if (enable == 0U) {
          g_cs_procedure_enabled = 0U;
          g_pending_cs_result_stage = 0U;
          g_cs_next_procedure_heartbeat = 0U;
          g_cs_next_subevent_heartbeat = 0U;
          g_cs_next_peer_stage_heartbeat = 0U;
          g_cs_next_chunk_stage_heartbeat = 0U;
          g_cs_last_interval_selector = 0U;
          g_cs_last_peer_gap_ticks = 0U;
          g_cs_active_subevent_index = 0U;
          g_cs_local_chunk_start_step = 0U;
          g_cs_peer_chunk_start_step = 0U;
        } else if (status == 0U) {
          g_cs_procedure_enabled = 1U;
          g_cs_procedure_counter = 1U;
          g_cs_procedure_abort_reason = 0U;
          g_cs_subevent_abort_reason = 0U;
          g_cs_active_subevent_index = 0U;
          g_pending_cs_result_stage = 1U;
          g_cs_next_procedure_heartbeat = 0U;
          g_cs_next_subevent_heartbeat = 0U;
          g_cs_next_peer_stage_heartbeat = 0U;
          g_cs_next_chunk_stage_heartbeat = 0U;
          g_cs_last_interval_selector = 0U;
          g_cs_last_peer_gap_ticks = 0U;
          g_cs_local_chunk_start_step = current_demo_subevent_start_step(0U);
          g_cs_peer_chunk_start_step = current_demo_subevent_start_step(0U);
        }
      }
#endif
      size_t len = append_h4_command_status((uint8_t *)g_vpr_transport->vprData + offset,
                                            NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                            opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != 0U) {
        break;
      }
      len = build_procedure_enable_complete_payload(payload, sizeof(payload), conn_handle);
      if (len == 0U) {
        return false;
      }
      len = append_h4_le_meta((uint8_t *)g_vpr_transport->vprData + offset,
                              NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                              BLE_CS_HCI_EVT_PROCEDURE_ENABLE_COMPLETE, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (enable != 0U) {
        g_pending_cs_result_stage = 1U;
        g_cs_next_peer_stage_heartbeat = 0U;
        g_cs_next_chunk_stage_heartbeat = 0U;
        g_cs_last_interval_selector = 0U;
        g_cs_last_peer_gap_ticks = 0U;
        g_cs_local_chunk_start_step = 0U;
        g_cs_peer_chunk_start_step = 0U;
      }
#if VPR_CS_DEDICATED_IMAGE
      if (enable != 0U) {
        if (cs_builtin_peer_demo_active()) {
          g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_PROCEDURE_ACTIVE;
          g_cs_peer_exchange_deadline = 0U;
        } else {
          g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_AWAITING_START;
          g_cs_peer_exchange_deadline =
              peer_deadline_for_stage(g_cs_peer_exchange_stage);
        }
      }
#endif
      break;
    }
    case BLE_CS_HCI_OP_TEST: {
      const uint8_t status = validate_cs_test_command();
      if (status == BLE_CS_HCI_STATUS_SUCCESS) {
        g_cs_test_active = 1U;
      }
      size_t len = append_h4_command_complete(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case BLE_CS_HCI_OP_TEST_END: {
      uint8_t status = BLE_CS_HCI_STATUS_SUCCESS;
      if (!command_layout_is_exact(0U)) {
        status = BLE_CS_HCI_STATUS_INVALID_PARAMS;
      } else if (g_cs_test_active == 0U) {
        status = BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
      } else {
        g_cs_test_active = 0U;
      }
      size_t len = append_h4_command_complete(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, status);
      if (len == 0U) {
        return false;
      }
      offset += len;
      if (status != BLE_CS_HCI_STATUS_SUCCESS) {
        break;
      }
      payload[0] = status;
      len = append_h4_le_meta(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
          BLE_CS_HCI_EVT_TEST_END_COMPLETE, payload,1U);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
#if VPR_CS_DEDICATED_IMAGE
    case VPR_HCI_OP_VENDOR_BLE_CS_PEER_PDU_INJECT: {
      size_t len =
          build_vendor_ble_cs_peer_pdu_inject_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CS_PEER_STAGE_READ: {
      size_t len =
          build_vendor_ble_cs_peer_stage_read_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CS_PENDING_LOCAL_PDU_READ: {
      size_t len =
          build_vendor_ble_cs_pending_local_pdu_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CS_SCHEDULER_READ: {
      size_t len =
          build_vendor_ble_cs_scheduler_read_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CS_MEASUREMENT_WORK_READ: {
      size_t len = build_vendor_ble_cs_measurement_work_read_complete_payload(payload,
                                                                              sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CS_MEASUREMENT_EXECUTE: {
      size_t len = build_vendor_ble_cs_measurement_execute_complete_payload(
          payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload(
          (uint8_t *)g_vpr_transport->vprData + offset,
          NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset, opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_BLE_CS_TONE_SNAPSHOT_READ: {
      size_t len = build_vendor_ble_cs_tone_snapshot_complete_payload(payload,
                                                                      sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
#endif
#if !VPR_CS_DEDICATED_IMAGE
    case VPR_HCI_OP_VENDOR_PING: {
      size_t len = build_vendor_ping_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_GET_TRANSPORT_INFO: {
      size_t len = build_vendor_info_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_FNV1A32: {
      size_t len = build_vendor_fnv1a_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_GET_CAPABILITIES: {
      size_t len = build_vendor_capabilities_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_CRC32: {
      size_t len = build_vendor_crc32_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_CRC32C: {
      size_t len = build_vendor_crc32c_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_TICKER_CONFIGURE: {
      size_t len = build_vendor_ticker_configure_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_TICKER_READ_STATE: {
      size_t len = build_vendor_ticker_state_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_ENTER_HIBERNATE: {
      size_t len = build_vendor_enter_hibernate_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
                                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA - offset,
                                               opcode, payload, len);
      if (len == 0U) {
        return false;
      }
      offset += len;
      break;
    }
    case VPR_HCI_OP_VENDOR_TICKER_EVENT_CONFIGURE: {
      size_t len = build_vendor_ticker_event_configure_complete_payload(payload, sizeof(payload));
      if (len == 0U) {
        return false;
      }
      len = append_h4_command_complete_payload((uint8_t *)g_vpr_transport->vprData + offset,
