lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
#if !VPR_CS_DEDICATED_IMAGE
static bool publish_pending_ticker_event(void) {
  uint8_t payload[20];
  size_t len = 0U;
  if (g_ticker_event_queue_count == 0U ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      host_request_pending()) {
    return false;
  }
  const vpr_ticker_event_entry_t *event = &g_ticker_event_queue[g_ticker_event_queue_head];
  zero_vpr_data();
  len = build_vendor_ticker_event_payload(payload, sizeof(payload), event);
  if (len == 0U) {
    return false;
  }
  len = append_h4_vendor_event((uint8_t *)g_vpr_transport->vprData,
                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA,
                               VPR_VENDOR_EVENT_TICKER, payload, len);
  if (len == 0U) {
    return false;
  }
  g_vpr_transport->vprLen = (uint32_t)len;
  g_vpr_transport->vprSeq = g_vpr_transport->vprSeq + 1U;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  bytes_zero(&g_ticker_event_queue[g_ticker_event_queue_head],
             sizeof(g_ticker_event_queue[g_ticker_event_queue_head]));
  g_ticker_event_queue_head = (g_ticker_event_queue_head + 1U) % VPR_TICKER_EVENT_QUEUE_DEPTH;
  g_ticker_event_queue_count = g_ticker_event_queue_count - 1U;
  return true;
}

static bool publish_pending_ble_legacy_adv_event(void) {
  uint8_t payload[24];
  size_t len = 0U;
  if (g_ble_legacy_adv_event_queue_count == 0U ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      host_request_pending()) {
    return false;
  }
  const vpr_ble_legacy_adv_event_entry_t *event =
      &g_ble_legacy_adv_event_queue[g_ble_legacy_adv_event_queue_head];
  zero_vpr_data();
  len = build_vendor_ble_legacy_adv_event_payload(payload, sizeof(payload), event);
  if (len == 0U) {
    return false;
  }
  len = append_h4_vendor_event((uint8_t *)g_vpr_transport->vprData,
                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA,
                               VPR_VENDOR_EVENT_BLE_LEGACY_ADV, payload, len);
  if (len == 0U) {
    return false;
  }
  g_vpr_transport->vprLen = (uint32_t)len;
  g_vpr_transport->vprSeq = g_vpr_transport->vprSeq + 1U;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  bytes_zero(&g_ble_legacy_adv_event_queue[g_ble_legacy_adv_event_queue_head],
             sizeof(g_ble_legacy_adv_event_queue[g_ble_legacy_adv_event_queue_head]));
  g_ble_legacy_adv_event_queue_head =
      (g_ble_legacy_adv_event_queue_head + 1U) % VPR_BLE_LEGACY_ADV_EVENT_QUEUE_DEPTH;
  g_ble_legacy_adv_event_queue_count = g_ble_legacy_adv_event_queue_count - 1U;
  return true;
}

static bool publish_pending_ble_connection_event(void) {
  uint8_t payload[32];
  size_t len = 0U;
  if (g_ble_connection_event_queue_count == 0U ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      host_request_pending()) {
    return false;
  }
  const vpr_ble_connection_event_entry_t *event =
      &g_ble_connection_event_queue[g_ble_connection_event_queue_head];
  zero_vpr_data();
  len = build_vendor_ble_connection_event_payload(payload, sizeof(payload), event);
  if (len == 0U) {
    return false;
  }
  len = append_h4_vendor_event((uint8_t *)g_vpr_transport->vprData,
                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA,
                               VPR_VENDOR_EVENT_BLE_CONNECTION, payload, len);
  if (len == 0U) {
    return false;
  }
  g_vpr_transport->vprLen = (uint32_t)len;
  g_vpr_transport->vprSeq = g_vpr_transport->vprSeq + 1U;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  bytes_zero(&g_ble_connection_event_queue[g_ble_connection_event_queue_head],
             sizeof(g_ble_connection_event_queue[g_ble_connection_event_queue_head]));
  g_ble_connection_event_queue_head =
      (g_ble_connection_event_queue_head + 1U) % VPR_BLE_CONNECTION_EVENT_QUEUE_DEPTH;
  g_ble_connection_event_queue_count = g_ble_connection_event_queue_count - 1U;
  return true;
}
#endif

static bool host_request_pending(void) {
  return ((g_host_transport->hostFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U) ||
         (g_host_transport->hostLen != 0U);
}

#if VPR_CS_DEDICATED_IMAGE
/* Detect VPR session-closed (BLE disconnect) and set abort reasons.
 * Called from the main loop before checking host requests. */
static void detect_and_handle_disconnect(void) {
  if (g_cs_session_open != 0U) { return; }
  if (g_cs_procedure_enabled != 0U || g_pending_cs_result_stage != 0U) {
    g_cs_procedure_abort_reason = 0x0BU;  /* Connection terminated by local host */
    g_cs_subevent_abort_reason = 0x0BU;
    g_cs_peer_exchange_stage = 0U;
    g_cs_peer_exchange_deadline = 0U;
    g_cs_procedure_enabled = 0U;
    clear_active_runtime_state();
    g_pending_cs_result_stage = 0U;
    g_cs_config_created = 0U;
    g_cs_security_enabled = 0U;
    g_cs_procedure_params_applied = 0U;
  }
}

/* Per-stage deadline in VPR heartbeat ticks. */
static uint32_t peer_deadline_for_stage(uint8_t stage) {
  switch (stage) {
    case VPR_CS_PEER_STAGE_AWAITING_CS_RSP:
    case VPR_CS_PEER_STAGE_AWAITING_CS_CFG:
      return g_vpr_transport->heartbeat + BLE_CS_PEER_CONFIG_TIMEOUT_TICKS;
    case VPR_CS_PEER_STAGE_AWAITING_PROC_RSP:
    case VPR_CS_PEER_STAGE_AWAITING_SEC_RSP:
      return g_vpr_transport->heartbeat + BLE_CS_PEER_PROC_TIMEOUT_TICKS;
    case VPR_CS_PEER_STAGE_AWAITING_START:
      return g_vpr_transport->heartbeat +
             ((uint32_t)g_cs_min_procedure_interval *
              BLE_CS_PEER_START_TIMEOUT_SCALE);
    default:
      return g_vpr_transport->heartbeat + BLE_CS_PEER_CONFIG_TIMEOUT_TICKS;
  }
}

/* Map peer-exchange stage to the appropriate HCI abort reason. */
static uint8_t abort_reason_for_peer_stage(uint8_t stage) {
  switch (stage) {
    case VPR_CS_PEER_STAGE_AWAITING_CS_RSP:
    case VPR_CS_PEER_STAGE_AWAITING_CS_CFG:
      return 0x07U;  /* Configuration Timeout */
    case VPR_CS_PEER_STAGE_AWAITING_SEC_RSP:
      return 0x09U;  /* Security Timeout */
    case VPR_CS_PEER_STAGE_AWAITING_PROC_RSP:
    case VPR_CS_PEER_STAGE_AWAITING_START:
    default:
      return 0x06U;  /* LL Procedure Timeout */
  }
}

/* Check if a peer-exchange operation has exceeded its deadline.
 * Called from the main loop after disconnect detection. */
static void check_peer_exchange_timeout(void) {
  if (g_cs_peer_exchange_stage == VPR_CS_PEER_STAGE_IDLE) { return; }
  if (g_cs_peer_exchange_stage == VPR_CS_PEER_STAGE_PROCEDURE_ACTIVE) { return; }
  if (g_vpr_transport->heartbeat < g_cs_peer_exchange_deadline) { return; }
  if (g_cs_procedure_enabled != 0U || g_pending_cs_result_stage != 0U) {
    g_cs_procedure_abort_reason =
        abort_reason_for_peer_stage(g_cs_peer_exchange_stage);
    g_cs_subevent_abort_reason = g_cs_procedure_abort_reason;
  }
  g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_IDLE;
  g_cs_peer_exchange_deadline = 0U;
  if (g_pending_cs_result_stage != 0U) {
    g_cs_procedure_enabled = 0U;
    clear_active_runtime_state();
    g_pending_cs_result_stage = 0U;
  }
}

